win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRFD/Rfd.c
                        ConsolePutROMString( (ROM char *)"Network(s) found. Trying to join " );
                        PrintChar( params.NLME_JOIN_request.PANId.byte.MSB );
                        PrintChar( params.NLME_JOIN_request.PANId.byte.LSB );
                        ConsolePutROMString( (ROM char *)".\r\n" );
                    }
                }
                else
                {
                    PrintChar( params.NLME_NETWORK_DISCOVERY_confirm.Status );
                    ConsolePutROMString( (ROM char *)" Error finding network.  Trying again...\r\n" );
                }
                break;

            case NLME_JOIN_confirm:
                if (!params.NLME_JOIN_confirm.Status)
                {
                    ConsolePutROMString( (ROM char *)"Join successful!\r\n" );

                    // Free the network descriptor list, if it exists. If we joined as an orphan, it will be NULL.
                    while (NetworkDescriptor)
                    {
                        currentNetworkDescriptor = NetworkDescriptor->next;
                        nfree( NetworkDescriptor );
                        NetworkDescriptor = currentNetworkDescriptor;
                    }
                    
                    /* package and send an end device announcement */
                    {
                        LONG_ADDR myLongAddress;
                        GetMACAddress(&myLongAddress);
                    
                        ConsolePutROMString( (ROM char *)"Announcing I am on the network\r\n" );
                        
                        ZigBeeBlockTx();
                        TxBuffer[TxData++] = APSCounter++;
                        TxBuffer[TxData++] = macPIB.macShortAddress.v[0];
                        TxBuffer[TxData++] = macPIB.macShortAddress.v[1];
                    
                        TxBuffer[TxData++] = myLongAddress.v[0];
                        TxBuffer[TxData++] = myLongAddress.v[1];
                        TxBuffer[TxData++] = myLongAddress.v[2];
                        TxBuffer[TxData++] = myLongAddress.v[3];
                        TxBuffer[TxData++] = myLongAddress.v[4];
                        TxBuffer[TxData++] = myLongAddress.v[5];
                        TxBuffer[TxData++] = myLongAddress.v[6];
                        TxBuffer[TxData++] = myLongAddress.v[7];
                    
                        TxBuffer[TxData++] = MY_CAPABILITY_INFO;
                    
                        params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;
                        params.APSDE_DATA_request.DstEndpoint = EP_ZDO;
                        params.APSDE_DATA_request.DstAddress.ShortAddr.Val = 0xFFFF; //destinationAddress;

                        params.APSDE_DATA_request.ProfileId.Val = ZDO_PROFILE_ID;
                        params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;
                        params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;						                            
                        params.APSDE_DATA_request.TxOptions.Val = 0;                          
                        params.APSDE_DATA_request.SrcEndpoint = EP_ZDO;
                        params.APSDE_DATA_request.ClusterId.Val = END_DEVICE_annce;
                        /* Set LEDs to the joined the network state */
                        GROUP_INDICATION	    = 1;
	                    MESSAGE_INDICATION		= 1;
                    
                        currentPrimitive = APSDE_DATA_request;
                    }

                }
                else
                {
                    currentPrimitive = NO_PRIMITIVE;
                    PrintChar( params.NLME_JOIN_confirm.Status );

                    // If we were trying as an orphan, see if we have some more orphan attempts.
                    if (ZigBeeStatus.flags.bits.bTryOrphanJoin)
                    {
                        // If we tried to join as an orphan, we do not have NetworkDescriptor, so we do
                        // not have to free it.

                        ConsolePutROMString( (ROM char *)" Could not join as orphan. " );
                        orphanTries--;
                        if (orphanTries == 0)
                        {
                            ConsolePutROMString( (ROM char *)"Must try as new node...\r\n" );
                            ZigBeeStatus.flags.bits.bTryOrphanJoin = 0;
                        }
                        else
                        {
                            ConsolePutROMString( (ROM char *)"Trying again...\r\n" );
                        }
                    }
                    else
                    {
                        ConsolePutROMString( (ROM char *)" Could not join selected network. " );
                        currentNetworkDescriptor = currentNetworkDescriptor->next;
                        if (currentNetworkDescriptor)
                        {
                            ConsolePutROMString( (ROM char *)"Trying next discovered network...\r\n" );
                            goto SubmitJoinRequest;
                        }
                        else
                        {
                            // We ran out of descriptors.  Free the network descriptor list, and fall
                            // through to try discovery again.
                            ConsolePutROMString( (ROM char *)"Cleaning up and retrying discovery...\r\n" );
                            while (NetworkDescriptor)
                            {
                                currentNetworkDescriptor = NetworkDescriptor->next;
                                nfree( NetworkDescriptor );
                                NetworkDescriptor = currentNetworkDescriptor;
                            }
                        }
                    }
                }
                break;

            case NLME_LEAVE_indication:
                {
                #if defined(__C30__)
                        LONG_ADDR myLongAddr;
                    
                        GetMACAddress(&myLongAddr);
                    if(!memcmppgm2ram( &params.NLME_LEAVE_indication.DeviceAddress, &myLongAddr, 8 ))   
                #else
                    if (!memcmppgm2ram( &params.NLME_LEAVE_indication.DeviceAddress, (ROM void *)&macLongAddr, 8 ))
                #endif
                    {
                        ConsolePutROMString( (ROM char *)"We have left the network.\r\n" );
                    }
                    else
                    {
                        ConsolePutROMString( (ROM char *)"Another node has left the network.\r\n" );
                    }
                } 
                    currentPrimitive = NO_PRIMITIVE;
                    break;

