win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRFD/Rfd.c
                                    currentPrimitive = APSME_REMOVE_GROUP_request;
                                    GROUP_INDICATION = 0;
                                    printf("   \r\nRemoved node from group 4\r\n");
                                }
                                group_state_ID4     = !group_state_ID4;
                            
                                break;
                             }
                        }
                        else        /* Debounce Timeout period calculation */
                        {
                            TICK t = TickGet();
                            tick2Difference.Val = TickGetDiff(t,PB_RIGHT_press_time);
                
                            if(tick2Difference.Val > DEBOUNCE_TIME)
                            {
                                PB_RIGHT_pressed = FALSE;
                            }    
                      
                        }
                        
                        /* Send Message for Group 4 Nodes */
                        if(PB_LEFT_SWITCH == 0 /* && (toggle == TRUE ) */ )
                        {
                            /* wait debounce time before taking any action again */
                            if(PB_LEFT_pressed == FALSE)
                            {
                                PB_LEFT_pressed = TRUE;
                                
                                /* Send group message to all the devices */
                                ZigBeeBlockTx();
                                TxBuffer[TxData++] = 0x0a;      /* request 10-bytes */

                                /* Use group addressing mode to send request */
                                params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_GROUP;
                    
                                /* GroupID MSB is zero in this example  */
                                params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = 0x00;
                                params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = GROUP_ID4;
                            
                                params.APSDE_DATA_request.SrcEndpoint               = GROUP_ID4;
                    
	                            params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;
                                params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_SUPPRESS;
                                #ifdef I_SUPPORT_SECURITY
                                    params.APSDE_DATA_request.TxOptions.Val = 1;
                                #else
	                            params.APSDE_DATA_request.TxOptions.Val = 0;
                                #endif
                    
                                /* no acknowledgement since this is a broadcast request */
	                            params.APSDE_DATA_request.TxOptions.bits.acknowledged = 0;
	                            params.APSDE_DATA_request.ProfileId.Val = 0x7f01;
                                params.APSDE_DATA_request.ClusterId.Val = BUFFER_TEST_REQUEST_CLUSTER;
                                currentPrimitive = APSDE_DATA_request;
                                
                                /* debounce lockout time start */
                                PB_LEFT_press_time = TickGet();
                                	 
                                break;
                            }   
                        }
                        else        /* Debounce Timeout period calculation */
                        {
                            TICK t = TickGet();
                            tickDifference.Val = TickGetDiff(t,PB_LEFT_press_time);
                
                            if(tickDifference.Val > DEBOUNCE_TIME)
                            {
                                PB_LEFT_pressed = FALSE;
                            }    
                      
                        }

            #if !defined(BOTH_MICRO_TRANSV_SLEEP)
                        /* check the menu to see if anything is there to process */
                        if (!ZigBeeStatus.flags.bits.bHasBackgroundTasks)
                        {
                            if ( ConsoleIsGetReady())
                            {
                                ProcessMenu();
                            }
                            
                        }
            #endif
                    }
                    /* Process when there are no primitives */
                    if (currentPrimitive == NO_PRIMITIVE)
                    {
                        if (!ZigBeeStatus.flags.bits.bDataRequestComplete)
                        {
                            // We have not received all data from our parent.  If we are not waiting
                            // for an answer from a data request, send a data request.
                            if (!ZigBeeStatus.flags.bits.bRequestingData)
                            {
                                if (ZigBeeReady())
                                {
                                    // Our parent still may have data for us.
                                    params.NLME_SYNC_request.Track = FALSE;
                                    currentPrimitive = NLME_SYNC_request;
                                }
                            }
                        }
                        else
                        {
                            if (!ZigBeeStatus.flags.bits.bHasBackgroundTasks )
                            {
                                // There is no primitive to execute,  all messages extracted
                                // from parent, the stack has no background tasks,
                                // and all application-specific processes are complete.  Now 
                                // go to sleep.  Make sure that the UART is finished, turn off the transceiver,
                                
                 #if defined(BOTH_MICRO_TRANSV_SLEEP)       
                                if(!ZigBeeStatus.flags.bits.bRadioIsSleeping)  
                                {
	                                while (!ConsoleIsPutReady());
                                    #if defined(__18F4620)
    	                                INTCONbits.RBIE = 1;
    	                            #endif
    	                            #if defined(__PIC24F__)
    	                                IEC1bits.CNIE   = 1;
    	                            #endif
    	                            MRF24J40Sleep();
	                                SLEEP();
        	                        NOP();

	                                /* Woken up by WDT, so request data from parent */
	                                MRF24J40Wake();
	                                params.NLME_SYNC_request.Track = FALSE;
	                                currentPrimitive = NLME_SYNC_request;
	                                
	                                /* Toggle LEDs at Polling rate */
                                    GROUP_INDICATION    = !GROUP_INDICATION;
                                    MESSAGE_INDICATION  = !MESSAGE_INDICATION;
	                             }
			     #endif
			    #if !defined(BOTH_MICRO_TRANSV_SLEEP)              
			                    /* To enable menu system, while still polling use this block */
								/* During End Device Bind speed up Polling, else go back to reqular polling rate */
								{
	                                TICK currentTime;
	                                /*	Capture the current time for initiating end device polling	*/
	                                
