win95/Wsanlab411/PIC24_Zigbee_Primary_31812/DemoPIC24FRFD/Rfd.c
        // Deselect the TC77 temperature sensor (RA2)
        LATA = 0x04;
    
        // Make RA0, RA1, RA2 and RA4 outputs.
        TRISA = 0xE0;
    #endif

    // Clear the RBIF flag (INTCONbits.RBIF)
    INTCONbits.RBIF = 0;

    // Enable PORTB pull-ups (INTCON2bits.RBPU)
    INTCON2bits.RBPU = 0;

    // Make the PORTB switch connections inputs.
    #if !defined(__18F4620)
        TRISDbits.TRISD7 = 0;
        TRISBbits.TRISB3 = 1;
    #endif
    
    TRISBbits.TRISB4 = 1;
    TRISBbits.TRISB5 = 1;
    PHY_WAKE        = 1;
    PHY_WAKE_TRIS = 0;
}

#endif

/*******************************************************************************
User Interrupt Handler

The stack uses some interrupts for its internal processing.  Once it is done
checking for its interrupts, the stack calls this function to allow for any
additional interrupt processing.
*******************************************************************************/
#if defined(__C30__)
void UserInterruptHandler(void)
{
}

void _ISRFAST __attribute__((interrupt, auto_psv)) _CNInterrupt(void)
{
    // *************************************************************************
    // Place any application-specific interrupt processing here
    // *************************************************************************
    // Is this an interrupt-on-change interrupt?
    if ( IFS1bits.CNIF == 1 )
    {
        // Disable further RBIF until we process it
        IEC1bits.CNIE = 0;

        // Clear mis-match condition and reset the interrupt flag
        LATD = PORTD;

        IFS1bits.CNIF = 0;
    }	
}

#else
void UserInterruptHandler(void)
{

    // *************************************************************************
    // Place any application-specific interrupt processing here
    // *************************************************************************

    // Is this an interrupt-on-change interrupt?
    if ( INTCONbits.RBIF == 1 )
    {

        // Disable further RBIF until we process it
        INTCONbits.RBIE = 0;

        // Clear mis-match condition and reset the interrupt flag
        LATB = PORTB;

        INTCONbits.RBIF = 0;
    }
}
#endif
void SendCountedPacket(BYTE seqNumber, BYTE len)
{
    		
	TxBuffer[TxData++] = 0x02 + len;   /*  Packet Length */
   	TxBuffer[TxData++] = 0;             /* MSB of Sequence Counter */
   	TxBuffer[TxData++] = seqNumber;     /* LSB Sequence Coounter */
   			
   	/* transmit a 10-byte octet sequence */		
    for(i = 0; i < len; i++)
    {
        TxBuffer[TxData++] = i;
    }

    params.APSDE_DATA_request.DstAddrMode = APS_ADDRESS_16_BIT;
       		
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[1] = byteMSB;
    params.APSDE_DATA_request.DstAddress.ShortAddr.v[0] = byteLSB;
    params.APSDE_DATA_request.SrcEndpoint    =  1;
    params.APSDE_DATA_request.DstEndpoint    =  240;
    params.APSDE_DATA_request.ProfileId.Val  = MY_PROFILE_ID;
    	    
    //params.APSDE_DATA_request.asduLength; TxData
	params.APSDE_DATA_request.RadiusCounter = DEFAULT_RADIUS;
	params.APSDE_DATA_request.DiscoverRoute = TRUE;
	params.APSDE_DATA_request.DiscoverRoute = ROUTE_DISCOVERY_ENABLE;
	   	    
	#ifdef I_SUPPORT_SECURITY
	    params.APSDE_DATA_request.TxOptions.Val = 1;
    #else
        params.APSDE_DATA_request.TxOptions.Val = 0;
    #endif
            
    params.APSDE_DATA_request.TxOptions.bits.acknowledged = 1;			        
    params.APSDE_DATA_request.ClusterId.Val = TRANSMIT_COUNTED_PACKETS_CLUSTER;	            
    				
    ZigBeeBlockTx();
    currentPrimitive = APSDE_DATA_request;	        
    
}
